Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg41_cult/pic32cx_sg41_getting_started/firmware/src/packs/PIC32CX1025SG41128_DFP/component/mclk.h
#define MCLK_APBBMASK_USB_Pos                 _UINT32_(0)                                          /* (MCLK_APBBMASK) USB APB Clock Enable Position */
#define MCLK_APBBMASK_USB_Msk                 (_UINT32_(0x1) << MCLK_APBBMASK_USB_Pos)             /* (MCLK_APBBMASK) USB APB Clock Enable Mask */
#define MCLK_APBBMASK_USB(value)              (MCLK_APBBMASK_USB_Msk & (_UINT32_(value) << MCLK_APBBMASK_USB_Pos)) /* Assigment of value for USB in the MCLK_APBBMASK register */
#define MCLK_APBBMASK_DSU_Pos                 _UINT32_(1)                                          /* (MCLK_APBBMASK) DSU APB Clock Enable Position */
#define MCLK_APBBMASK_DSU_Msk                 (_UINT32_(0x1) << MCLK_APBBMASK_DSU_Pos)             /* (MCLK_APBBMASK) DSU APB Clock Enable Mask */
#define MCLK_APBBMASK_DSU(value)              (MCLK_APBBMASK_DSU_Msk & (_UINT32_(value) << MCLK_APBBMASK_DSU_Pos)) /* Assigment of value for DSU in the MCLK_APBBMASK register */
#define MCLK_APBBMASK_NVMCTRL_Pos             _UINT32_(2)                                          /* (MCLK_APBBMASK) NVMCTRL APB Clock Enable Position */
#define MCLK_APBBMASK_NVMCTRL_Msk             (_UINT32_(0x1) << MCLK_APBBMASK_NVMCTRL_Pos)         /* (MCLK_APBBMASK) NVMCTRL APB Clock Enable Mask */
#define MCLK_APBBMASK_NVMCTRL(value)          (MCLK_APBBMASK_NVMCTRL_Msk & (_UINT32_(value) << MCLK_APBBMASK_NVMCTRL_Pos)) /* Assigment of value for NVMCTRL in the MCLK_APBBMASK register */
#define MCLK_APBBMASK_PORT_Pos                _UINT32_(4)                                          /* (MCLK_APBBMASK) PORT APB Clock Enable Position */
#define MCLK_APBBMASK_PORT_Msk                (_UINT32_(0x1) << MCLK_APBBMASK_PORT_Pos)            /* (MCLK_APBBMASK) PORT APB Clock Enable Mask */
#define MCLK_APBBMASK_PORT(value)             (MCLK_APBBMASK_PORT_Msk & (_UINT32_(value) << MCLK_APBBMASK_PORT_Pos)) /* Assigment of value for PORT in the MCLK_APBBMASK register */
#define MCLK_APBBMASK_EVSYS_Pos               _UINT32_(7)                                          /* (MCLK_APBBMASK) EVSYS APB Clock Enable Position */
#define MCLK_APBBMASK_EVSYS_Msk               (_UINT32_(0x1) << MCLK_APBBMASK_EVSYS_Pos)           /* (MCLK_APBBMASK) EVSYS APB Clock Enable Mask */
#define MCLK_APBBMASK_EVSYS(value)            (MCLK_APBBMASK_EVSYS_Msk & (_UINT32_(value) << MCLK_APBBMASK_EVSYS_Pos)) /* Assigment of value for EVSYS in the MCLK_APBBMASK register */
#define MCLK_APBBMASK_SERCOM2_Pos             _UINT32_(9)                                          /* (MCLK_APBBMASK) SERCOM2 APB Clock Enable Position */
#define MCLK_APBBMASK_SERCOM2_Msk             (_UINT32_(0x1) << MCLK_APBBMASK_SERCOM2_Pos)         /* (MCLK_APBBMASK) SERCOM2 APB Clock Enable Mask */
#define MCLK_APBBMASK_SERCOM2(value)          (MCLK_APBBMASK_SERCOM2_Msk & (_UINT32_(value) << MCLK_APBBMASK_SERCOM2_Pos)) /* Assigment of value for SERCOM2 in the MCLK_APBBMASK register */
#define MCLK_APBBMASK_SERCOM3_Pos             _UINT32_(10)                                         /* (MCLK_APBBMASK) SERCOM3 APB Clock Enable Position */
#define MCLK_APBBMASK_SERCOM3_Msk             (_UINT32_(0x1) << MCLK_APBBMASK_SERCOM3_Pos)         /* (MCLK_APBBMASK) SERCOM3 APB Clock Enable Mask */
#define MCLK_APBBMASK_SERCOM3(value)          (MCLK_APBBMASK_SERCOM3_Msk & (_UINT32_(value) << MCLK_APBBMASK_SERCOM3_Pos)) /* Assigment of value for SERCOM3 in the MCLK_APBBMASK register */
#define MCLK_APBBMASK_TCC0_Pos                _UINT32_(11)                                         /* (MCLK_APBBMASK) TCC0 APB Clock Enable Position */
#define MCLK_APBBMASK_TCC0_Msk                (_UINT32_(0x1) << MCLK_APBBMASK_TCC0_Pos)            /* (MCLK_APBBMASK) TCC0 APB Clock Enable Mask */
#define MCLK_APBBMASK_TCC0(value)             (MCLK_APBBMASK_TCC0_Msk & (_UINT32_(value) << MCLK_APBBMASK_TCC0_Pos)) /* Assigment of value for TCC0 in the MCLK_APBBMASK register */
#define MCLK_APBBMASK_TCC1_Pos                _UINT32_(12)                                         /* (MCLK_APBBMASK) TCC1 APB Clock Enable Position */
#define MCLK_APBBMASK_TCC1_Msk                (_UINT32_(0x1) << MCLK_APBBMASK_TCC1_Pos)            /* (MCLK_APBBMASK) TCC1 APB Clock Enable Mask */
#define MCLK_APBBMASK_TCC1(value)             (MCLK_APBBMASK_TCC1_Msk & (_UINT32_(value) << MCLK_APBBMASK_TCC1_Pos)) /* Assigment of value for TCC1 in the MCLK_APBBMASK register */
#define MCLK_APBBMASK_TC2_Pos                 _UINT32_(13)                                         /* (MCLK_APBBMASK) TC2 APB Clock Enable Position */
#define MCLK_APBBMASK_TC2_Msk                 (_UINT32_(0x1) << MCLK_APBBMASK_TC2_Pos)             /* (MCLK_APBBMASK) TC2 APB Clock Enable Mask */
#define MCLK_APBBMASK_TC2(value)              (MCLK_APBBMASK_TC2_Msk & (_UINT32_(value) << MCLK_APBBMASK_TC2_Pos)) /* Assigment of value for TC2 in the MCLK_APBBMASK register */
#define MCLK_APBBMASK_TC3_Pos                 _UINT32_(14)                                         /* (MCLK_APBBMASK) TC3 APB Clock Enable Position */
#define MCLK_APBBMASK_TC3_Msk                 (_UINT32_(0x1) << MCLK_APBBMASK_TC3_Pos)             /* (MCLK_APBBMASK) TC3 APB Clock Enable Mask */
#define MCLK_APBBMASK_TC3(value)              (MCLK_APBBMASK_TC3_Msk & (_UINT32_(value) << MCLK_APBBMASK_TC3_Pos)) /* Assigment of value for TC3 in the MCLK_APBBMASK register */
#define MCLK_APBBMASK_RAMECC_Pos              _UINT32_(16)                                         /* (MCLK_APBBMASK) RAMECC APB Clock Enable Position */
#define MCLK_APBBMASK_RAMECC_Msk              (_UINT32_(0x1) << MCLK_APBBMASK_RAMECC_Pos)          /* (MCLK_APBBMASK) RAMECC APB Clock Enable Mask */
#define MCLK_APBBMASK_RAMECC(value)           (MCLK_APBBMASK_RAMECC_Msk & (_UINT32_(value) << MCLK_APBBMASK_RAMECC_Pos)) /* Assigment of value for RAMECC in the MCLK_APBBMASK register */
#define MCLK_APBBMASK_Msk                     _UINT32_(0x00017E97)                                 /* (MCLK_APBBMASK) Register Mask  */

#define MCLK_APBBMASK_SERCOM_Pos              _UINT32_(9)                                          /* (MCLK_APBBMASK Position) SERCOM2 APB Clock Enable */
#define MCLK_APBBMASK_SERCOM_Msk              (_UINT32_(0x3) << MCLK_APBBMASK_SERCOM_Pos)          /* (MCLK_APBBMASK Mask) SERCOM */
#define MCLK_APBBMASK_SERCOM(value)           (MCLK_APBBMASK_SERCOM_Msk & (_UINT32_(value) << MCLK_APBBMASK_SERCOM_Pos)) 
#define MCLK_APBBMASK_TCC_Pos                 _UINT32_(11)                                         /* (MCLK_APBBMASK Position) TCCx APB Clock Enable */
#define MCLK_APBBMASK_TCC_Msk                 (_UINT32_(0x3) << MCLK_APBBMASK_TCC_Pos)             /* (MCLK_APBBMASK Mask) TCC */
#define MCLK_APBBMASK_TCC(value)              (MCLK_APBBMASK_TCC_Msk & (_UINT32_(value) << MCLK_APBBMASK_TCC_Pos)) 
#define MCLK_APBBMASK_TC_Pos                  _UINT32_(13)                                         /* (MCLK_APBBMASK Position) TC2 APB Clock Enable */
#define MCLK_APBBMASK_TC_Msk                  (_UINT32_(0x3) << MCLK_APBBMASK_TC_Pos)              /* (MCLK_APBBMASK Mask) TC */
#define MCLK_APBBMASK_TC(value)               (MCLK_APBBMASK_TC_Msk & (_UINT32_(value) << MCLK_APBBMASK_TC_Pos)) 

